app/controllers/user_controller.rb

  def create
    @user = User.new(strong_params)
      if @user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('qwerty', 'qwerty2403@mail.ru', '$2a$10$SRZYrtwDdU.Q4sE3FKG.w.Cu/qTMgSvce1iof3yhcdSF4a99EZzGW', '2017-11-16 12:39:03', '2017-11-16 12:39:03')

  def signin
    @user = User.find_by_email(params[:email])
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'aserer@masdas.rt' LIMIT 1